/**
 * Created by NSD on 05.03.17.
 */
package model;
/*
//todo Описание
Неистовое сборище моделей для визуализации всяких приколов
//todo Зависмости
Нет (сильные и независимые классы)
//todo Роль
Скелет для библиотеки GSON,Databasы
//todo Controllers
Каждый класс модели имеет одноименный конроллер (ModelName + Controller f.e News -> NewsController)
//todo DB
Классы аннотированы по ormLite lib
//todo Исключения :
* ModelForJSONBorn - по факту структура с массивом значений и количеством
* значений для удобного представления в виде JSON {values:[{.....}],values.count:3423}
*
*
*
*
*Внимание анекдот: Колобок повесился
*
*
*
* */